Repository: XCode-Blue/StopSun-iOS
Catalog: StopSun/Shared/Resources/Localizable.xcstrings
Source language: ko
Languages: en

# chart.minutes.format
source: %lld분
en: %lldmin

# chart.weekly.recentDays
source: 최근 7일
en: Last 7 Days

# chart.weekly.title
source: 주간 자외선 노출 요약
en: Weekly UV Exposure Summary

# common.button.cancel
source: 취소
en: Cancel

# common.button.confirm
source: 확인
en: OK

# common.button.guide
source: 안내
en: Guide

# common.button.next
source: 다음
en: Next

# common.button.openSettings
source: 설정 열기
en: Open Settings

# common.button.retry
source: 재시도
en: Retry

# common.button.setting
source: 설정
en: Setting

# common.button.skip
source: 건너뛰기
en: Skip

# dashboard.weather.temperature
source: 현재 기온
en: Temperature

# dashboard.weather.title
source: %@ 날씨 정보
en: %@ Weather

# dashboard.weather.uvIndex
source: UV 지수
en: UV Index

# error.healthKit.authorizationDenied
source: 건강 데이터 접근이 거부되었습니다. 설정에서 권한을 허용해주세요.
en: HealthKit access was denied. Please enable it in Settings.

# error.healthKit.backgroundDeliveryFailed
source: 백그라운드 건강 데이터 업데이트 설정에 실패했습니다.
en: Failed to enable background health data updates.

# error.healthKit.dataFetchFailed
source: 건강 데이터를 불러오는데 실패했습니다. 다시 시도해주세요.
en: Failed to fetch health data. Please try again.

# error.healthKit.notAvailable
source: 이 기기에서는 건강 데이터를 사용할 수 없습니다.
en: HealthKit is not available on this device.

# error.location.authorizationDenied
source: 위치 접근이 거부되었습니다. 설정에서 권한을 허용해주세요.
en: Location access was denied. Please enable it in Settings.

# error.location.geocodingFailed
source: 위치 이름을 가져오는데 실패했습니다.
en: Failed to get location name.

# error.location.locationUnavailable
source: 현재 위치를 가져올 수 없습니다. 다시 시도해주세요.
en: Unable to get current location. Please try again.

# error.location.servicesDisabled
source: 위치 서비스가 비활성화되어 있습니다. 설정에서 활성화해주세요.
en: Location services are disabled. Please enable them in Settings.

# error.network.noConnection
source: 인터넷에 연결되어 있지 않습니다. 네트워크를 확인해주세요.
en: No internet connection. Please check your network.

# error.network.serverError
source: 서버 오류가 발생했습니다 (코드: %d). 잠시 후 다시 시도해주세요.
en: Server error occurred (Code: %d). Please try again later.

# error.network.timeout
source: 요청 시간이 초과되었습니다. 다시 시도해주세요.
en: Request timed out. Please try again.

# error.notification.authorizationDenied
source: 알림 권한이 거부되었습니다. 설정에서 권한을 허용해주세요.
en: Notification access was denied. Please enable it in Settings.

# error.notification.invalidDate
source: 유효하지 않은 알림 시간입니다.
en: Invalid notification time.

# error.notification.scheduleFailed
source: 알림 예약에 실패했습니다. 다시 시도해주세요.
en: Failed to schedule notification. Please try again.

# error.storage.dataCorrupted
source: 데이터가 손상되었습니다. 일부 설정을 다시 해야 할 수 있습니다.
en: Data is corrupted. Some settings may need to be reset.

# error.storage.insufficientSpace
source: 저장 공간이 부족합니다. 공간을 확보해주세요.
en: Not enough storage space. Please free up some space.

# error.storage.loadFailed
source: 데이터를 불러오는데 실패했습니다. 다시 시도해주세요.
en: Failed to load data. Please try again.

# error.storage.saveFailed
source: 데이터 저장에 실패했습니다. 다시 시도해주세요.
en: Failed to save data. Please try again.

# error.title.healthKit
source: 건강 데이터 오류
en: Health Data Error

# error.title.location
source: 위치 오류
en: Location Error

# error.title.network
source: 네트워크 오류
en: Network Error

# error.title.notification
source: 알림 오류
en: Notification Error

# error.title.storage
source: 저장 오류
en: Storage Error

# error.title.unknown
source: 오류
en: Error

# error.title.watchConnectivity
source: 워치 연결 오류
en: Watch Connection Error

# error.title.weather
source: 날씨 오류
en: Weather Error

# error.unknown
source: 알 수 없는 오류가 발생했습니다. 다시 시도해주세요.
en: An unexpected error occurred. Please try again.

# error.watchConnectivity.notReachable
source: Apple Watch에 연결할 수 없습니다. 워치가 가까이 있고 잠금이 해제되어 있는지 확인해주세요.
en: Unable to connect to Apple Watch. Please make sure your watch is nearby and unlocked.

# error.watchConnectivity.sessionInactive
source: 워치 연결 세션이 비활성 상태입니다. 다시 시도해주세요.
en: Watch connection session is inactive. Please try again.

# error.watchConnectivity.transferFailed
source: Apple Watch로 데이터 전송에 실패했습니다.
en: Failed to send data to Apple Watch.

# error.weather.invalidLocation
source: 날씨 데이터를 가져올 수 없는 위치입니다.
en: Invalid location for weather data.

# error.weather.parsingFailed
source: 날씨 데이터 처리에 실패했습니다.
en: Failed to process weather data.

# error.weather.quotaExceeded
source: 날씨 서비스 사용량을 초과했습니다. 잠시 후 다시 시도해주세요.
en: Weather service limit reached. Please try again later.

# error.weather.requestFailed
source: 날씨 정보를 가져오는데 실패했습니다. 다시 시도해주세요.
en: Failed to fetch weather data. Please try again.

# info.empty.prepare
source: 자외선과 피부 보호에 대한 유용한 정보를 준비하고 있어요.
en: Helpful information about UV protection and skin care is coming soon.

# info.error.loadFailed
source: 정보를 불러올 수 없습니다
en: Failed to load information

# info.title
source: 정보
en: Info

# liveActivity.timer.remaining
source: 남음
en: left

# liveActivity.timer.title
source: 선크림 타이머
en: Sunscreen Timer

# liveActivity.uv.current
source: 현재 UV
en: Current UV

# liveActivity.uv.levelSuffix
source: 수준 !
en: level !

# med.gauge.title
source: UV 노출량
en: UV Exposure

# med.max.uv
source: 최대 UV 노출량
en: Maximum UV Exposure

# med.status.caution.desc
source: 실내 활동을 고려해보세요.
en: Consider limiting outdoor exposure.

# med.status.caution.title
source: 주의
en: caution

# med.status.critical.desc
source: 실내 활동을 권장합니다.
en: It is recommended to engage in indoor activities.

# med.status.critical.title
source: 나쁨
en: critical

# med.status.danger.desc
source: 외출을 자제하고 그늘로 이동하는 것이 좋습니다.
en: Avoid direct sun exposure and seek shade.

# med.status.danger.title
source: 위험
en: danger

# med.status.prefix
source: 현재 UV 노출량은
en: Your current UV exposure is at a

# med.status.safe.desc
source: 야외 활동에 큰 문제가 없습니다.
en: Outdoor activity is generally safe.

# med.status.safe.title
source: 안전
en: safe

# med.status.suffix
source: 수준
en: level

# med.status.warning.desc
source: 외출을 자제하고 그늘로 이동하는 것이 좋습니다.
en: Avoid direct sun exposure and seek shade.

# med.status.warning.title
source: 경고
en: warning

# med.today.uv
source: 오늘 UV 노출량
en: Today's UV Exposure

# notification.action.apply
source: 선크림 바르기
en: Apply Sunscreen

# notification.action.dismiss
source: 닫기
en: Dismiss

# notification.action.snooze
source: 15분 후 다시 알림
en: Remind in 15 min

# notification.med.body30
source: 일일 자외선 노출량의 30%%에 도달했습니다. 자외선 노출에 주의하세요.
en: You've reached 30%% of your daily UV exposure. Stay aware of your UV exposure.

# notification.med.body50
source: 일일 자외선 노출량의 절반에 도달했습니다.
en: You've reached half of your daily UV exposure limit.

# notification.med.body70
source: 일일 자외선 한계의 70%%에 도달했습니다. 그늘을 찾는 것이 좋습니다.
en: You've reached 70%% of your daily UV limit. Consider seeking shade.

# notification.med.body100
source: 일일 자외선 한계에 도달했습니다! 그늘로 이동하거나 실내로 들어가세요.
en: You've reached your daily UV limit! Please seek shade or go indoors.

# notification.med.title30
source: 자외선 노출 30%%
en: 30%% UV Exposure

# notification.med.title50
source: 자외선 노출 50%%
en: 50%% UV Exposure

# notification.med.title70
source: 자외선 노출 70%%
en: 70%% UV Exposure

# notification.med.title100
source: 자외선 한계 도달!
en: UV Limit Reached!

# notification.reapply.body
source: 선크림을 바른 지 2시간이 지났습니다. 다시 발라주세요!
en: It's been 2 hours since you applied sunscreen. Time to reapply!

# notification.reapply.title
source: 선크림 다시 바를 시간이에요
en: Time to Reapply Sunscreen

# onboarding.introduction.personalRecommend.subtitle
source: UV 지수, 날씨, 개인 활동 패턴을 분석해 나만의 피부 관리 가이드를 제공해요.
en: Get personalized skin care guides by analyzing UV index, weather, and your activity patterns.

# onboarding.introduction.personalRecommend.title
source: 개인 맞춤 추천
en: Personalized Recommendations

# onboarding.introduction.realTimeAlert.subtitle
source: 현재 위치와 날씨 데이터를 기반으로 최적의 선크림 사용 시점에 알림을 줘요.
en: Get alerts at the optimal time to apply sunscreen based on your location and weather data.

# onboarding.introduction.realTimeAlert.title
source: 실시간 자외선 알림
en: Real-time UV Alerts

# onboarding.introduction.startSetup
source: 기본 설정하기
en: Start Setup

# onboarding.introduction.trackExposure.subtitle
source: Apple Watch 에서 수집된 일광량을 모니터링해요.
en: Monitor sun exposure data collected from your Apple Watch.

# onboarding.introduction.trackExposure.title
source: 일광 노출을 추적
en: Track Sun Exposure

# onboarding.permission.button.continue
source: 계속
en: Continue

# onboarding.permission.denied.title
source: 위치 권한이 필요해요
en: Location Permission Required

# onboarding.permission.healthKit.title
source: 건강 접근
en: Health Access

# onboarding.permission.location.title
source: 위치 서비스 접근
en: Location Services

# onboarding.permission.notification.title
source: 알림 접근
en: Notifications

# onboarding.permission.title
source: 필요 권한 설정하기
en: Set up permissions

# onboarding.skinType.button.start
source: 시작하기
en: Get started

# onboarding.skinType.title
source: 피부 타입 설정하기
en: Set your skin type

# onboarding.title
source: 그만해 앱 시작하기
en: How to use App 'StopSun'

# onboarding.watch.alert.notPaired.message
source: 현재 iPhone과 페어링된 Apple Watch를 찾을 수 없어요. Apple Watch 7세대 또는 SE 2세대 이상이 필요해요.
en: No paired Apple Watch found. Apple Watch Series 7 or SE 2nd generation or later is required.

# onboarding.watch.alert.notPaired.title
source: 기기 모델을 확인해주세요
en: Please check your device model

# onboarding.watch.alert.noWatch.title
source: Apple Watch 보유를 권장해요!
en: Apple Watch is recommended!

# onboarding.watch.button.no
source: 아니오, 없어요
en: No, I don't

# onboarding.watch.button.yes
source: 네, 보유 중이에요
en: Yes, I have one

# settings.appInfo.privacy
source: 개인정보 처리 방침
en: Privacy Policy

# settings.appInfo.support
source: 앱 정보 및 지원
en: App Info & Support

# settings.healthKit.desc
source: 건강 앱의 일광시간 데이터 접근 허용 방법을 안내해요.
en: Learn how to enable daylight data access in the Health app.

# settings.healthKit.guide
source: 설정 > 앱 > 건강에서 일광시간 데이터 접근을 허용해주세요.
en: Go to Settings > Apps > Health and enable daylight data access.

# settings.healthKit.guide.step1
source: 설정 앱에서 '앱'을 선택해요.
en: Select 'Apps' in the Settings app.

# settings.healthKit.guide.step2
source: '건강'을 선택해요.
en: Select 'Health'.

# settings.healthKit.guide.step3
source: '데이터 접근 및 기기'를 선택해요.
en: Select 'Data Access & Devices'.

# settings.healthKit.guide.step4
source: '그만해'를 선택해요.
en: Select 'StopSun'.

# settings.healthKit.guide.step5
source: '일광 시간' 읽기를 허용해요.
en: Enable 'Daylight Time' reading.

# settings.healthKit.title
source: 건강 데이터 권한
en: Health Data Access

# settings.permission.desc
source: 알림, 위치 권한을 설정해요.
en: Manage notification and location permissions.

# settings.permission.title
source: 앱 권한 설정
en: App Permissions

# settings.section.appInfo
source: 앱 정보
en: App Information

# settings.section.service
source: 서비스 설정
en: Service Settings

# settings.section.skin
source: 피부 정보
en: Skin Information

# settings.skinType.desc
source: 피츠패트릭 피부 타입을 수정해요.
en: Change your Fitzpatrick skin type.

# settings.skinType.heading
source: 피부 타입 설정하기
en: Set your skin type

# settings.skinType.nav.title
source: 피부 타입 설정
en: Skin Type

# settings.skinType.subtitle
source: 나에게 맞는 자외선 차단 방식 추천을 위해 설명을 보고 내 피부 타입을 선택해주세요.
en: Select your skin type based on the descriptions for personalized UV protection recommendations.

# settings.skinType.title
source: 피부 타입 설정
en: Skin Type

# settings.spf.desc
source: 사용하는 선크림의 SPF 지수를 수정해요.
en: Change your sunscreen SPF level.

# settings.spf.title
source: 선크림 SPF 설정
en: Sunscreen SPF

# settings.title
source: 설정
en: Settings

# skin.maxMED.format
source: 하루 최대 권장 MED: %.0f J/m²
en: Recommended max MED: %.0f J/m²

# skin.type1.description
source: 항상 타거나 화상을 입음, 거의 태닝되지 않음
en: Always burns, never tans

# skin.type1.summary
source: 매우 하얀 피부, 주근깨 많음
en: Very fair skin, many freckles

# skin.type1.title
source: 1형
en: Type 1

# skin.type2.description
source: 쉽게 타고, 태닝이 어려움
en: Burns easily, tans with difficulty

# skin.type2.summary
source: 하얀 피부, 주근깨 있음
en: Fair skin, some freckles

# skin.type2.title
source: 2형
en: Type 2

# skin.type3.description
source: 가끔 타지만 점진적으로 태닝됨
en: Sometimes burns, gradually tans

# skin.type3.summary
source: 약간 어두운 피부
en: Medium skin tone

# skin.type3.title
source: 3형
en: Type 3

# skin.type4.description
source: 거의 타지 않고 쉽게 태닝됨
en: Rarely burns, tans easily

# skin.type4.summary
source: 올리브톤 또는 황갈색 피부
en: Olive or light brown skin

# skin.type4.title
source: 4형
en: Type 4

# skin.type5.description
source: 거의 타지 않고 매우 쉽게 태닝됨
en: Very rarely burns, tans very easily

# skin.type5.summary
source: 갈색 피부
en: Brown skin

# skin.type5.title
source: 5형
en: Type 5

# skin.type6.description
source: 거의 타지 않음, 자연스럽게 어두운 색소
en: Never burns, naturally dark pigmentation

# skin.type6.summary
source: 매우 어두운 갈색/검은 피부
en: Very dark brown or black skin

# skin.type6.title
source: 6형
en: Type 6

# spf.none
source: 미사용
en: None

# sunscreen.card.watchPrompt
source: 선크림 타이머를 워치에서 작동시켜주세요
en: Start the sunscreen timer on your Apple Watch

# sunscreen.effectiveness.excellent
source: 매우 좋음
en: Excellent

# sunscreen.effectiveness.good
source: 보통
en: Good

# sunscreen.effectiveness.reapply
source: 재발림 필요
en: Reapply needed

# sunscreen.effectiveness.weak
source: 약함
en: Weak

# sunscreen.time.expired
source: 만료됨
en: Expired

# sunscreen.time.hours
source: %lld시간
en: %lld hours

# sunscreen.time.hours_minutes
source: %lld시간 %lld분
en: %lld hours %lld minutes

# sunscreen.time.minutes
source: %lld분
en: %lld minutes

# tab.dashboard
source: 대시보드
en: Dashboard

# tab.info
source: 정보
en: Info

# tab.settings
source: 설정
en: Settings

# timer.cancel
source: 취소
en: Cancel

# timer.reapply.alert
source: 재도포할 시간!
en: Time to reapply!

# timer.refresh
source: 갱신
en: Refresh

# timer.restart
source: 재시작
en: Restart

# timer.start
source: 시작
en: Start

# timer.start.prompt
source: 선크림 타이머를 시작하시겠습니까?
en: Start sunscreen timer?

# timer.stop
source: 중지
en: Stop

# timer.untilReapply
source: 재도포까지
en: Until reapply

# uv.label
source: 자외선
en: UV Index

# uv.level.extreme
source: 위험
en: Extreme

# uv.level.high
source: 위험
en: High

# uv.level.low
source: 안심
en: Low

# uv.level.moderate
source: 주의
en: Moderate

# uv.level.veryHigh
source: 매우 위험
en: Very High
